<?php
// Возвращаемый массив покемонов для RB-арены
return [
    [
        "pokemon" => 429, // Мисмагиус
        "lvl" => 85,
        "ability" => 96,
        "item" => 166,
        "attacks" => [108, 554, 639, 467],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 312, // Минун
        "lvl" => 88,
        "ability" => 224,
        "item" => 142,
        "attacks" => [341, 143, 566, 238],
        "gen" => "29,29,29,30,29,29"
    ],
    [
        "pokemon" => 473, // Мамосвайн
        "lvl" => 78,
        "ability" => 128,
        "item" => 166,
        "attacks" => [136, 259, 63, 715],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 71, // Викрибелл
        "lvl" => 90,
        "ability" => 22,
        "item" => 145,
        "attacks" => [278, 628, 490, 493],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 478, // Фросласс
        "lvl" => 84,
        "ability" => 31,
        "item" => 132,
        "attacks" => [554, 108, 255, 467],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 490, // Манафи
        "lvl" => 76,
        "ability" => 78,
        "item" => 145,
        "attacks" => [549, 538, 146, 255],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 28, // Сендслеш
        "lvl" => 89,
        "ability" => 159,
        "item" => 145,
        "attacks" => [278, 136, 420, 523],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 587, // Эмолга
        "lvl" => 88,
        "ability" => 115,
        "item" => 0,
        "attacks" => [5, 566, 350, 143],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 214, // Геракросс
        "lvl" => 78,
        "ability" => 70,
        "item" => 166,
        "attacks" => [152, 78, 278, 314],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 130, // Гаярдос
        "lvl" => 74,
        "ability" => 89,
        "item" => 145,
        "attacks" => [123, 599, 97, 257],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 407, // Розерейд
        "lvl" => 83,
        "ability" => 120,
        "item" => 166,
        "attacks" => [510, 493, 198, 547],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 573, // Шиншино
        "lvl" => 82,
        "ability" => 174,
        "item" => 166,
        "attacks" => [436, 550, 65, 583],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 127, // Пинсир
        "lvl" => 84,
        "ability" => 116,
        "item" => 166,
        "attacks" => [523, 278, 615, 136],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 297, // Харияма
        "lvl" => 86,
        "ability" => 70,
        "item" => 166,
        "attacks" => [64, 78, 278, 152],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 189, // Джумплаф
        "lvl" => 90,
        "ability" => 85,
        "item" => 0,
        "attacks" => [143, 490, 583, 5],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 381, // Латиос
        "lvl" => 73,
        "ability" => 96,
        "item" => 145,
        "attacks" => [121, 447, 66, 408],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 31, // Нидоквин
        "lvl" => 81,
        "ability" => 134,
        "item" => 145,
        "attacks" => [573, 494, 135, 255],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 531, // Аудино
        "lvl" => 91,
        "ability" => 152,
        "item" => 145,
        "attacks" => [401, 607, 161, 639],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 302, // Сабли
        "lvl" => 81,
        "ability" => 138,
        "item" => 142,
        "attacks" => [629, 605, 103, 66],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 206, // Данспарс
        "lvl" => 93,
        "ability" => 165,
        "item" => 137,
        "attacks" => [136, 447, 223, 201],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 670, // Флоэтт
        "lvl" => 83,
        "ability" => 56,
        "item" => 145,
        "attacks" => [332, 238, 146, 290],
        "gen" => "29,30,29,30,30,29"
    ],
    [
        "pokemon" => 301, // Делкетти
        "lvl" => 85,
        "ability" => 32,
        "item" => 137,
        "attacks" => [565, 119, 153, 384],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 711, // Гургейст
        "lvl" => 88,
        "ability" => 61,
        "item" => 145,
        "attacks" => [547, 605, 463, 471],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 454, // Токсикрок
        "lvl" => 83,
        "ability" => 45,
        "item" => 166,
        "attacks" => [129, 136, 213, 545],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 571, // Зороарк
        "lvl" => 81,
        "ability" => 82,
        "item" => 135,
        "attacks" => [171, 103, 493, 583],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 208, // Стиликс
        "lvl" => 80,
        "ability" => 196,
        "item" => 145,
        "attacks" => [257, 516, 234, 136],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 327, // Спинда
        "lvl" => 97,
        "ability" => 29,
        "item" => 145,
        "attacks" => [536, 533, 442, 152],
        "gen" => "30,30,30,30,30,30"
    ],
    [
        "pokemon" => 663, // Талонфлейм
        "lvl" => 79,
        "ability" => 52,
        "item" => 0,
        "attacks" => [447, 583, 172, 5],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 706, // Гудра
        "lvl" => 85,
        "ability" => 162,
        "item" => 145,
        "attacks" => [127, 628, 121, 136],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 604, // Илектросс
        "lvl" => 85,
        "ability" => 96,
        "item" => 145,
        "attacks" => [278, 583, 112, 171],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 359, // Абсол
        "lvl" => 81,
        "ability" => 92,
        "item" => 135,
        "attacks" => [384, 533, 565, 278],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 426, // Дрифблим
        "lvl" => 83,
        "ability" => 3,
        "item" => 0,
        "attacks" => [605, 236, 5, 565],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 385, // Джирачи
        "lvl" => 77,
        "ability" => 165,
        "item" => 145,
        "attacks" => [607, 48, 270, 618],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 402, // Крикетун
        "lvl" => 97,
        "ability" => 207,
        "item" => 145,
        "attacks" => [520, 554, 278, 619],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 286, // Брелум
        "lvl" => 82,
        "ability" => 207,
        "item" => 166,
        "attacks" => [65, 442, 56, 286],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 178, // Ксату
        "lvl" => 87,
        "ability" => 46,
        "item" => 145,
        "attacks" => [404, 447, 66, 233],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 632, // Дюрант
        "lvl" => 79,
        "ability" => 77,
        "item" => 144,
        "attacks" => [270, 615, 536, 97],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 368, // Горебис
        "lvl" => 83,
        "ability" => 202,
        "item" => 145,
        "attacks" => [474, 248, 255, 630],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 614, // Биартик
        "lvl" => 94,
        "ability" => 176,
        "item" => 166,
        "attacks" => [536, 715, 523, 216],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 139, // Омастар
        "lvl" => 83,
        "ability" => 170,
        "item" => 145,
        "attacks" => [247, 255, 474, 516],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 350, // Милотик
        "lvl" => 83,
        "ability" => 108,
        "item" => 145,
        "attacks" => [629, 456, 220, 255],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 483, // Диалга
        "lvl" => 73,
        "ability" => 139,
        "item" => 145,
        "attacks" => [161, 174, 121, 566],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 234, // Сентлер
        "lvl" => 90,
        "ability" => 89,
        "item" => 166,
        "attacks" => [119, 136, 272, 565],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 106, // Хитмонли
        "lvl" => 86,
        "ability" => 150,
        "item" => 145,
        "attacks" => [62, 523, 78, 278],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 565, // Карракоста
        "lvl" => 87,
        "ability" => 196,
        "item" => 145,
        "attacks" => [599, 516, 523, 16],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 62, // Поливтор
        "lvl" => 89,
        "ability" => 202,
        "item" => 166,
        "attacks" => [419, 258, 178, 599],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 185, // Судовудо
        "lvl" => 94,
        "ability" => 155,
        "item" => 145,
        "attacks" => [222, 610, 533, 63],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 494, // Виктини
        "lvl" => 77,
        "ability" => 222,
        "item" => 142,
        "attacks" => [585, 583, 604, 404],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 558, // Крастл
        "lvl" => 82,
        "ability" => 196,
        "item" => 143,
        "attacks" => [523, 136, 278, 474],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 689, // Барбаракл
        "lvl" => 82,
        "ability" => 213,
        "item" => 145,
        "attacks" => [422, 136, 523, 474],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 334, // Алтария
        "lvl" => 80,
        "ability" => 120,
        "item" => 145,
        "attacks" => [447, 161, 136, 123],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 237, // Хитмонтоп
        "lvl" => 88,
        "ability" => 89,
        "item" => 145,
        "attacks" => [420, 78, 523, 63],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 59, // Арканайн
        "lvl" => 82,
        "ability" => 89,
        "item" => 145,
        "attacks" => [604, 172, 434, 334],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 319, // Шарпедо
        "lvl" => 80,
        "ability" => 184,
        "item" => 166,
        "attacks" => [257, 388, 97, 599],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 211, // Квилфиш
        "lvl" => 84,
        "ability" => 89,
        "item" => 145,
        "attacks" => [749, 554, 510, 573],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 430, // Ханчкроу
        "lvl" => 82,
        "ability" => 116,
        "item" => 166,
        "attacks" => [55, 447, 533, 536],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 528, // Свубат
        "lvl" => 87,
        "ability" => 219,
        "item" => 145,
        "attacks" => [66, 524, 447, 233],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 22, // Фироу
        "lvl" => 88,
        "ability" => 177,
        "item" => 143,
        "attacks" => [132, 119, 583, 131],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 3, // Венозавр
        "lvl" => 79,
        "ability" => 126,
        "item" => 145,
        "attacks" => [493, 198, 547, 286],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 20, // Ратикейт
        "lvl" => 90,
        "ability" => 77,
        "item" => 144,
        "attacks" => [119, 414, 97, 545],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 560, // Скрафти
        "lvl" => 83,
        "ability" => 116,
        "item" => 145,
        "attacks" => [278, 129, 62, 618],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 625, // Бишарп
        "lvl" => 79,
        "ability" => 139,
        "item" => 135,
        "attacks" => [533, 278, 270, 419],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 660, // Диггерзбай
        "lvl" => 81,
        "ability" => 76,
        "item" => 166,
        "attacks" => [136, 545, 414, 152],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 563, // Кофагригус
        "lvl" => 86,
        "ability" => 119,
        "item" => 145,
        "attacks" => [573, 605, 220, 236],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 160, // Фералигатор
        "lvl" => 79,
        "ability" => 212,
        "item" => 166,
        "attacks" => [123, 258, 97, 599],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 701, // Холуча
        "lvl" => 77,
        "ability" => 133,
        "item" => 0,
        "attacks" => [484, 237, 5, 545],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 612, // Гаксорус
        "lvl" => 77,
        "ability" => 133,
        "item" => 166,
        "attacks" => [123, 136, 554, 370],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 337, // Лунатон
        "lvl" => 96,
        "ability" => 96,
        "item" => 145,
        "attacks" => [333, 404, 516, 202],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 338, // Солрок
        "lvl" => 90,
        "ability" => 96,
        "item" => 145,
        "attacks" => [334, 136, 605, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 97, // Гипно
        "lvl" => 96,
        "ability" => 88,
        "item" => 145,
        "attacks" => [607, 401, 565, 404],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 306, // Агрон
        "lvl" => 86,
        "ability" => 155,
        "item" => 150,
        "attacks" => [222, 234, 136, 164],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 326, // Грумпиг
        "lvl" => 93,
        "ability" => 210,
        "item" => 145,
        "attacks" => [602, 178, 404, 146],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 638, // Кобалион
        "lvl" => 78,
        "ability" => 92,
        "item" => 145,
        "attacks" => [78, 270, 516, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 99, // Кинглер
        "lvl" => 89,
        "ability" => 79,
        "item" => 166,
        "attacks" => [10, 439, 93, 278],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 94, // Генгар
        "lvl" => 78,
        "ability" => 31,
        "item" => 166,
        "attacks" => [467, 494, 178, 605],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 6, // Чаризард
        "lvl" => 78,
        "ability" => 180,
        "item" => 145,
        "attacks" => [504, 171, 124, 534],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 110, // Визинг
        "lvl" => 78,
        "ability" => 96,
        "item" => 145,
        "attacks" => [233, 573, 493, 605],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 330, // Флайгон
        "lvl" => 83,
        "ability" => 96,
        "item" => 166,
        "attacks" => [370, 583, 523, 136],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 186, // Политоед
        "lvl" => 86,
        "ability" => 43,
        "item" => 145,
        "attacks" => [456, 255, 143, 401],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 598, // Ферроторн
        "lvl" => 73,
        "ability" => 90,
        "item" => 145,
        "attacks" => [286, 516, 215, 628],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 485, // Хитран
        "lvl" => 78,
        "ability" => 54,
        "item" => 150,
        "attacks" => [605, 401, 135, 281],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 476, // Пробопас
        "lvl" => 91,
        "ability" => 196,
        "item" => 150,
        "attacks" => [135, 395, 304, 565],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 413, // Вармадам
        "lvl" => 88,
        "ability" => 125,
        "item" => 145,
        "attacks" => [401, 61, 283, 404],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 468, // Тогекисс
        "lvl" => 79,
        "ability" => 165,
        "item" => 166,
        "attacks" => [12, 27, 639, 340],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 666, // Вивиллон
        "lvl" => 83,
        "ability" => 28,
        "item" => 145,
        "attacks" => [490, 61, 416, 246],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 480, // Юкси
        "lvl" => 82,
        "ability" => 96,
        "item" => 145,
        "attacks" => [583, 565, 404, 146],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 313, // Волбит
        "lvl" => 90,
        "ability" => 138,
        "item" => 145,
        "attacks" => [143, 583, 565, 419],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 26, // Райчу
        "lvl" => 87,
        "ability" => 98,
        "item" => 145,
        "attacks" => [592, 566, 350, 202],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 477, // Даскноир
        "lvl" => 89,
        "ability" => 139,
        "item" => 145,
        "attacks" => [236, 605, 136, 471],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 346, // Крадили
        "lvl" => 89,
        "ability" => 194,
        "item" => 145,
        "attacks" => [198, 516, 15, 629],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 122, // Мистер Майм
        "lvl" => 89,
        "ability" => 51,
        "item" => 166,
        "attacks" => [341, 404, 639, 178],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 213, // Шакл
        "lvl" => 84,
        "ability" => 196,
        "item" => 145,
        "attacks" => [278, 516, 520, 442],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 243, // Райку
        "lvl" => 79,
        "ability" => 139,
        "item" => 166,
        "attacks" => [592, 238, 27, 566],
        "gen" => "29,29,29,30,29,29"
    ],
   [
        "pokemon" => 442, // Спиритомб
        "lvl" => 88,
        "ability" => 139,
        "item" => 145,
        "attacks" => [66, 103, 467, 429],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 128, // Торос
        "lvl" => 82,
        "ability" => 89,
        "item" => 166,
        "attacks" => [119, 136, 618, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 389, // Тортерра
        "lvl" => 87,
        "ability" => 126,
        "item" => 145,
        "attacks" => [610, 136, 516, 547],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 707, // Клефки
        "lvl" => 79,
        "ability" => 138,
        "item" => 145,
        "attacks" => [510, 565, 384, 184],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 512, // Симисейдж
        "lvl" => 88,
        "ability" => 126,
        "item" => 166,
        "attacks" => [198, 238, 341, 178],
        "gen" => "29,29,29,30,29,29"
    ],
   [
        "pokemon" => 332, // Кактурн
        "lvl" => 90,
        "ability" => 225,
        "item" => 166,
        "attacks" => [510, 533, 198, 129],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 505, // Ватчог
        "lvl" => 94,
        "ability" => 5,
        "item" => 145,
        "attacks" => [97, 293, 250, 535],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 55, // Голдак
        "lvl" => 90,
        "ability" => 202,
        "item" => 166,
        "attacks" => [255, 178, 248, 143],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 445, // Гарчомп
        "lvl" => 79,
        "ability" => 161,
        "item" => 145,
        "attacks" => [136, 121, 171, 455],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 550, // Баскулин
        "lvl" => 86,
        "ability" => 1,
        "item" => 166,
        "attacks" => [536, 618, 599, 16],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 550, // Баскулин
        "lvl" => 86,
        "ability" => 1,
        "item" => 166,
        "attacks" => [536, 618, 599, 16],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 902, // Баскулиджен
        "lvl" => 82,
        "ability" => 1,
        "item" => 145,
        "attacks" => [381, 257, 771, 16],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 693, // Кловицер
        "lvl" => 85,
        "ability" => 109,
        "item" => 145,
        "attacks" => [27, 103, 124, 626],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 40, // Виглипафф
        "lvl" => 93,
        "ability" => 32,
        "item" => 145,
        "attacks" => [401, 639, 607, 516],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 383, // Граудон
        "lvl" => 73,
        "ability" => 44,
        "item" => 145,
        "attacks" => [164, 136, 62, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 184, // Азумарил
        "lvl" => 81,
        "ability" => 76,
        "item" => 129,
        "attacks" => [536, 384, 599, 16],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 591, // Амунгус
        "lvl" => 83,
        "ability" => 134,
        "item" => 145,
        "attacks" => [515, 198, 493, 547],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 267, // Бьютифлай
        "lvl" => 98,
        "ability" => 200,
        "item" => 145,
        "attacks" => [11, 61, 416, 238],
        "gen" => "29,29,29,29,30,30"
    ],
   [
        "pokemon" => 635, // Гидрайгон
        "lvl" => 81,
        "ability" => 96,
        "item" => 135,
        "attacks" => [103, 135, 124, 174],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 518, // Мушарна
        "lvl" => 88,
        "ability" => 204,
        "item" => 145,
        "attacks" => [66, 333, 408, 467],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 181, // Амфарос
        "lvl" => 83,
        "ability" => 189,
        "item" => 145,
        "attacks" => [10, 124, 178, 566],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 230, // Кингдра
        "lvl" => 84,
        "ability" => 177,
        "item" => 143,
        "attacks" => [599, 270, 370, 123],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 589, // Эскавальер
        "lvl" => 84,
        "ability" => 200,
        "item" => 145,
        "attacks" => [615, 270, 132, 278],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 141, // Кабутопс
        "lvl" => 87,
        "ability" => 229,
        "item" => 166,
        "attacks" => [545, 278, 523, 749],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 437, // Бронзонг
        "lvl" => 85,
        "ability" => 96,
        "item" => 145,
        "attacks" => [270, 404, 136, 516],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 78, // Рапидаш
        "lvl" => 87,
        "ability" => 54,
        "item" => 145,
        "attacks" => [132, 604, 334, 172],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 195, // Квагсаер
        "lvl" => 88,
        "ability" => 219,
        "item" => 145,
        "attacks" => [136, 629, 456, 255],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 59, // Арканайн-хисуи
        "lvl" => 79,
        "form" => "hisuian",
        "ability" => 155,
        "item" => 145,
        "attacks" => [151, 172, 222, 78],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 101, // Электрод-хисуи
        "lvl" => 85,
        "form" => "hisuian",
        "ability" => 189,
        "item" => 166,
        "attacks" => [146, 566, 554, 565],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 157, // Тифложен-хисуи
        "lvl" => 83,
        "form" => "hisuian",
        "ability" => 18,
        "item" => 166,
        "attacks" => [161, 178, 467, 605],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 211, // Квилфиш-хисуи
        "lvl" => 83,
        "form" => "hisuian",
        "ability" => 89,
        "item" => 145,
        "attacks" => [97, 213, 510, 573],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 503, // Самурот-хисуи
        "lvl" => 77,
        "form" => "hisuian",
        "ability" => 212,
        "item" => 145,
        "attacks" => [422, 451, 533, 545],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 549, // Лилигант-хисуи
        "lvl" => 79,
        "form" => "hisuian",
        "ability" => 212,
        "item" => 144,
        "attacks" => [78, 107, 282, 208],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 571, // Зороарк-хисуи
        "lvl" => 80,
        "form" => "hisuian",
        "ability" => 82,
        "item" => 166,
        "attacks" => [171, 768, 178, 341],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 628, // Брейвиари-хисуи
        "lvl" => 85,
        "form" => "hisuian",
        "ability" => 93,
        "item" => 145,
        "attacks" => [10, 233, 246, 404],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 706, // Гудра-хисуи
        "lvl" => 83,
        "form" => "hisuian",
        "ability" => 162,
        "item" => 145,
        "attacks" => [121, 127, 136, 234],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 713, // Авалагг-хисуи
        "lvl" => 83,
        "form" => "hisuian",
        "ability" => 196,
        "item" => 145,
        "attacks" => [30, 420, 629, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 724, // Десиджуай-хисуи
        "lvl" => 87,
        "form" => "hisuian",
        "ability" => 164,
        "item" => 145,
        "attacks" => [107, 282, 278, 447],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 197, // Умбреон
        "lvl" => 84,
        "ability" => 204,
        "item" => 145,
        "attacks" => [184, 572, 401, 607],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 700, // Сильвеон
        "lvl" => 84,
        "ability" => 32,
        "item" => 145,
        "attacks" => [66, 630, 401, 607],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 134, // Вапореон
        "lvl" => 84,
        "ability" => 225,
        "item" => 145,
        "attacks" => [456, 255, 401, 607],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 38, // Найнтелс
        "lvl" => 84,
        "ability" => 44,
        "item" => 145,
        "attacks" => [161, 504, 467, 103],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 596, // Гальвантула
        "lvl" => 82,
        "ability" => 28,
        "item" => 141,
        "attacks" => [520, 61, 112, 198],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 38, // Найнтелс-алола
        "lvl" => 78,
        "form" => "alola",
        "ability" => 179,
        "item" => 132,
        "attacks" => [655, 45, 143, 332],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 131, // Лапрас
        "lvl" => 85,
        "ability" => 225,
        "item" => 145,
        "attacks" => [631, 248, 255, 404],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 738, // Викавольт
        "lvl" => 83,
        "ability" => 96,
        "item" => 145,
        "attacks" => [61, 112, 146, 520],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 405, // Люксрей
        "lvl" => 88,
        "ability" => 89,
        "item" => 166,
        "attacks" => [257, 384, 604, 434],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 492, // Шаймин
        "lvl" => 82,
        "ability" => 120,
        "item" => 145,
        "attacks" => [135, 286, 146, 208],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 673, // Гогоат
        "lvl" => 88,
        "ability" => 162,
        "item" => 145,
        "attacks" => [136, 62, 244, 321],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 80, // Слоубро-галар
        "lvl" => 87,
        "form" => "galar",
        "ability" => 152,
        "item" => 145,
        "attacks" => [136, 404, 538, 184],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 110, // Визинг-галар
        "lvl" => 86,
        "form" => "galar",
        "ability" => 96,
        "item" => 145,
        "attacks" => [107, 213, 161, 605],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 144, // Артикуно-галар
        "lvl" => 84,
        "form" => "galar",
        "ability" => 139,
        "item" => 145,
        "attacks" => [764, 246, 629, 425],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 145, // Запдос-галар
        "lvl" => 77,
        "form" => "galar",
        "ability" => 139,
        "item" => 166,
        "attacks" => [55, 62, 78, 583],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 146, // Молтрес-галар
        "lvl" => 79,
        "form" => "galar",
        "ability" => 16,
        "item" => 166,
        "attacks" => [10, 766, 246, 341],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 199, // Слоукинг-галар
        "lvl" => 85,
        "form" => "galar",
        "ability" => 152,
        "item" => 145,
        "attacks" => [493, 161, 404, 290],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 903, // Снислер
        "lvl" => 74,
        "ability" => 139,
        "item" => 166,
        "attacks" => [78, 769, 583, 414],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 229, // Хондум
        "lvl" => 83,
        "ability" => 54,
        "item" => 166,
        "attacks" => [103, 493, 341, 171],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 861, // Гриммснарл
        "lvl" => 83,
        "ability" => 138,
        "item" => 169,
        "attacks" => [290, 425, 565, 384],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 448, // Лукарио
        "lvl" => 82,
        "ability" => 92,
        "item" => 166,
        "attacks" => [78, 151, 545, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 219, // Магкарго
        "lvl" => 95,
        "ability" => 229,
        "item" => 145,
        "attacks" => [135, 15, 171, 474],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 279, // Пелипер
        "lvl" => 86,
        "ability" => 43,
        "item" => 145,
        "attacks" => [246, 278, 447, 538],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 475, // Галлейд
        "lvl" => 80,
        "ability" => 92,
        "item" => 166,
        "attacks" => [294, 347, 406, 78],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 9, // Бластойз
        "lvl" => 80,
        "ability" => 212,
        "item" => 145,
        "attacks" => [248, 136, 255, 474],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 24, // Арбок
        "lvl" => 87,
        "ability" => 89,
        "item" => 145,
        "attacks" => [388, 136, 533, 572],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 45, // Вайлплюм
        "lvl" => 85,
        "ability" => 22,
        "item" => 145,
        "attacks" => [198, 493, 534, 572],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 51, // Дагтрио
        "lvl" => 84,
        "ability" => 8,
        "item" => 166,
        "attacks" => [136, 523, 533, 468],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 89, // Мак-алола
        "lvl" => 82,
        "form" => "alola",
        "ability" => 135,
        "item" => 145,
        "attacks" => [129, 278, 213, 258],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 103, // Экзекутор-алола
        "lvl" => 89,
        "form" => "alola",
        "ability" => 61,
        "item" => 145,
        "attacks" => [121, 171, 198, 283],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 51, // Дагтрио-алола
        "lvl" => 84,
        "form" => "alola",
        "ability" => 158,
        "item" => 166,
        "attacks" => [136, 270, 533, 455],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 53, // Персиан-алола
        "lvl" => 86,
        "form" => "alola",
        "ability" => 63,
        "item" => 166,
        "attacks" => [103, 395, 341, 566],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 823, // Корвикнайт
        "lvl" => 80,
        "ability" => 139,
        "item" => 145,
        "attacks" => [55, 107, 234, 447],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 750, // Мадсдэйл
        "lvl" => 83,
        "ability" => 187,
        "item" => 145,
        "attacks" => [136, 234, 516, 523],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 981, // Фарижираф
        "lvl" => 91,
        "ability" => 162,
        "item" => 145,
        "attacks" => [48, 66, 524, 607],
        "gen" => "30,30,30,30,30,30"
    ],
   [
        "pokemon" => 952, // Сковиллан
        "lvl" => 91,
        "ability" => 22,
        "item" => 145,
        "attacks" => [171, 198, 534, 97],
        "gen" => "30,30,30,30,30,30"
    ],
];